2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/GBAConversie-Registratie-Naam-Geslacht_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:brp="http://www.bzk.nl/brp/brp0200">
   <soapenv:Header/>
   <soapenv:Body>
      <brp:bhg_nmgRegistreerNaamGeslacht>
         <brp:stuurgegevens brp:communicatieID="comid_stuurgegevens">
            <brp:zendendePartij>036101</brp:zendendePartij>
            <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
            <brp:referentienummer>00000000-0000-0000-0001-000000000001</brp:referentienummer>
            <brp:tijdstipVerzending>${DataSource Values#tijdstipVerzending}</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="comid_params">
            <brp:verwerkingswijze>Bijhouding</brp:verwerkingswijze>
         </brp:parameters>
         <brp:wijzigingGeslachtsnaam brp:communicatieID="comid.wijzigingGeslachtsnaam" brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>036101</brp:partijCode>
            <brp:toelichtingOntlening>toelichting</brp:toelichtingOntlening>
            <brp:bronnen>
               <brp:bron brp:objecttype="ActieBron" brp:communicatieID="comid_bron1">
                  <brp:document brp:communicatieID="Document1" brp:objecttype="Document">
                     <brp:soortNaam>Geboorteakte</brp:soortNaam>
                     <brp:identificatie>identificatieTC0101</brp:identificatie>
                     <brp:aktenummer>1234567</brp:aktenummer>
                     <brp:partijCode>036101</brp:partijCode>
                  </brp:document>
               </brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieNaamGeslacht brp:communicatieID="comid.registratieNaamGeslacht1" brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>2014-04-01</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <brp:bron brp:communicatieID="BronDocument1" brp:referentieID="comid_bron1" brp:objecttype="ActieBron"></brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="comid.persoon1" brp:objecttype="Persoon" brp:objectSleutel="${DataSource Values#burgerServiceNummer}">
                     <brp:samengesteldeNaam brp:communicatieID="comid.samengesteldeNaam">
                        <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                     </brp:samengesteldeNaam>
                     <brp:geslachtsaanduiding brp:communicatieID="comid.geslachtsaanduiding1">
                        <brp:code>V</brp:code>
                     </brp:geslachtsaanduiding>
                     <brp:voornamen>
                        <brp:voornaam brp:objecttype="PersoonVoornaam" brp:communicatieID="comid.voornaam1">
                           <brp:volgnummer>1</brp:volgnummer>
                           <brp:naam>Jan</brp:naam>
                        </brp:voornaam>
                        <brp:voornaam brp:objecttype="PersoonVoornaam" brp:communicatieID="comid.voornaam2">
                           <brp:volgnummer>2</brp:volgnummer>
                           <brp:naam>${DataSource Values#burgerServiceNummer}</brp:naam>
                        </brp:voornaam>
                     </brp:voornamen>
                     <brp:geslachtsnaamcomponenten>
                        <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent" brp:communicatieID="comid.geslachtsnaam">
                           <brp:predicaatCode>J</brp:predicaatCode>
                           <brp:stam>Janssen</brp:stam>
                        </brp:geslachtsnaamcomponent>
                     </brp:geslachtsnaamcomponenten>
                  </brp:persoon>
               </brp:registratieNaamGeslacht>
            </brp:acties>
         </brp:wijzigingGeslachtsnaam>
      </brp:bhg_nmgRegistreerNaamGeslacht>
   </soapenv:Body>
</soapenv:Envelope>